wkPoiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (-1  0 -1)
    ( 1  0 -1)
    ( 1 30 -1)
    (-1 30 -1)

    (-1  0  1)
    ( 1  0  1)
    ( 1 30  1)
    (-1 30  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 240 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    right
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (6 5 1 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
