wkPoiseuille/constant/windkesselProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     5.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      windkesselProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// All is listed in SI units, don't add new items that are not outlets

right
{
  C  1.45e-8;
  R  1.45e8;
  Z  1.1e7;
  outIndex 0; // Needed to match the values with those listed in the boundary condition
}

// ************************************************************************* //
